INSERT INTO country(name,phone_code)
VALUES ('Россия','+7'),('Франция','+33'),('Великобритания','+44'),('Китай','+86');

INSERT INTO city(name,country_id)
VALUES ('Орёл',1),('Москва',1),
('Париж',2),('Лондон',3);

INSERT INTO branch(street,house,phone,city_id,company_id)
VALUES ('Комсомольская', '81', '+79208281152',1,1),('Наугорское шоссе', '19', '+79209455432',1,1),
('50 лет Октября', '15', '+79408282354',2,1),
('Ришелье', '39', '+339704681453',3,1),
('Шафтсбери авеню', '19', '+442348424152',4,1);

INSERT INTO seller(lastname,firstname,patronymic,phone,branch_id)
VALUES ('Александров','А','А', '+79209872132',1),('Аринский', 'В','С', '+79203324562',1),
('Григорьев' ,'М','С.', '+79890539924 ',2),('Зорина ','Н','А', '+79619240478',2),
('Андреев ','А','Д', '+79129884445',3),('Иванов ','Г','А', '+79587570037',3),
('Антуан ','П','А', '+339699736518',4),('Мари','И','Ф', '+339763207731',4),
('Адамсон ','У','А', '+449999992667',5),('Эдриан ','В','А', '+449709461246',5);

INSERT INTO type(name)
VALUES ('Монитор'),('Процессор'),('Видеокарта'),
('Оперативная память'),('Материнская плата'),('Кулер');

INSERT INTO characteristics(name,measure_units)
VALUES ('Диагональ','Дюймов'),('Герцовка','Гц'),
('Техпроцесс','нм'),('Частота', 'МГц'),
('Разрядность шины','bit'),('Объем','Гб'),
('Поддержка частот оперативной памяти','МГц'),('Максимальный объем оперативной памяти','Гб'),
('Ширина','См'),('Длинна','См'),('Глубина','См');

INSERT INTO characteristics(name)
VALUES ('Разрешение'),('Матрица'),
('Сокет'),('Количество ядер'),('Количество потоков'),
('Тип памяти'),
('Слотов памяти DDR4');

INSERT INTO type_characteristics(type_id,characteristics_id)
VALUES (1,1),(1,2),(1,12),(1,13),
(2,3),(2,4),(2,14),(2,15),(2,16),
(3,5),(3,6),(3,17),(3,9),(3,4),
(4,6),(4,9),(4,17),
(5,7),(5,8),(5,18),(5,14),
(6,9),(6,10),(6,11);
  
INSERT INTO manufacturer(name, phone, country_id)
VALUES ('LG','+868005555555',4),('Aoc','+8688003508845',4),('AMD','+8688433508845',4),('NVIDIA','+868800567745',4);

INSERT INTO product(name,price,price_purchases,description, manufacturer_id, type_id)
VALUES ('S24F354FHI',20000,10000,'Монитор способствует отображению детализированной и контрастной картинки, лишенной малейших искажений, поскольку в его основу положена матрица PLS.',1,1),
('Ryzen 7 3800XT',60000,30000,'Процессор представляет собой высокопроизводительное решение, которое может стать отличной основой для игровых и рабочих систем. ',3,2),
('GeForce GTX 1050',40000,20000,'Отличный выбор для пользователей, которые хотят создать игровую систему начального или среднего уровня.',4,3);

INSERT INTO product(name,price,price_purchases,description, manufacturer_id, type_id)
VALUES ('hgifjdi',20001,10000,'Монитор способствует отображению детализированной и контрастной картинки, лишенной малейших искажений, поскольку в его основу положена матрица PLS.',1,1),
('23igfi',20001,10000,'Монитор способствует отображению детализированной и контрастной картинки, лишенной малейших искажений, поскольку в его основу положена матрица PLS.',1,1);

INSERT INTO product_characteristics(product_id, characteristics_id, value)
VALUES (1,1,'24'),(1,2,'75'),(2,3,'7'),(2,4,'3700'),(3,5,'128'),(3,4,'1290'),(1,12,'1920x1080'),
(1,13,'PLS'),(2,14,'AM4'),(2,15,'8'),(2,16,'9'),(3,6,'2'),(3,17,'GDDR5');

INSERT INTO product_characteristics(product_id, characteristics_id, value)
VALUES (4,1,'24'),(5,1,'14');

INSERT INTO branch_product(branch_id, product_id, quantity)
VALUES (1,1,5),(1,2,5),(1,3,5),
(2,1,5),(2,2,5),(2,3,5),
(3,1,5),(3,2,5),(3,3,5),
(4,1,5),(4,2,5),(4,3,5),
(5,1,5),(5,2,5),(5,3,5);


INSERT INTO branch_product(branch_id, product_id, quantity)
VALUES(1,4,6),(1,5,7)

INSERT INTO sale(seller_id, date)
VALUES (1,curdate()), (3,curdate()),(4,curdate());

INSERT INTO sale_product(sale_id, product_id, quantity)
VALUES (1,1,1),(1,2,3),
(2,1,1),
(3,1,1);